# Pandas Basic Notebook

# import pandas

In [3]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.2'

# Pandas Data Structure

In [6]:
s = pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [8]:
df = pd.DataFrame({
    "name": ["Siri","Deepu"],
    "age": [19,20]
})
df

    name  age
0   Siri   19
1  Deepu   20

# Reading Data (CSV)

In [11]:
df = pd.read_csv('data.csv')
df

   city  temp  humidity condition
0   hyd    23        45     rainy
1   hyd    24        46     rainy
2   hyd    25        47     rainy
3   hyd    26        48     sunny
4  bang    27        49     sunny
5  bang    28        50     sunny
6  bang    29        51    cloudy
7  bang    30        52    cloudy

# writing the data into files

In [14]:
df.to_csv('data.csv',index=False)

# Exploring Data

In [17]:
df.head()

   city  temp  humidity condition
0   hyd    23        45     rainy
1   hyd    24        46     rainy
2   hyd    25        47     rainy
3   hyd    26        48     sunny
4  bang    27        49     sunny

In [19]:
df.tail(3)

   city  temp  humidity condition
5  bang    28        50     sunny
6  bang    29        51    cloudy
7  bang    30        52    cloudy

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   city       8 non-null      object
 1   temp       8 non-null      int64
 2   humidity   8 non-null      int64
 3   condition  8 non-null      object
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [23]:
df.shape

(8, 4)

In [69]:
df['city'][df['condition'] == 'rainy']

0    hyd
1    hyd
2    hyd
Name: city, dtype: object

In [46]:
df[2:5]

   city  temp  humidity condition
2   hyd    25        47     rainy
3   hyd    26        48     sunny
4  bang    27        49     sunny

In [48]:
df.columns

Index(['city', 'temp', 'humidity', 'condition'], dtype='object')

In [50]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [54]:
df.dtypes

city         object
temp          int64
humidity      int64
condition    object
dtype: object

In [58]:
df.city

0     hyd
1     hyd
2     hyd
3     hyd
4    bang
5    bang
6    bang
7    bang
Name: city, dtype: object

In [60]:
df[['city','condition']]

   city condition
0   hyd     rainy
1   hyd     rainy
2   hyd     rainy
3   hyd     sunny
4  bang     sunny
5  bang     sunny
6  bang    cloudy
7  bang    cloudy

In [62]:
df.temp

0    23
1    24
2    25
3    26
4    27
5    28
6    29
7    30
Name: temp, dtype: int64

# Missing Value

In [65]:
df.isnull()

    city   temp  humidity  condition
0  False  False     False      False
1  False  False     False      False
2  False  False     False      False
3  False  False     False      False
4  False  False     False      False
5  False  False     False      False
6  False  False     False      False
7  False  False     False      False

In [91]:
df = pd.DataFrame({
    "name" : ["siri","deepu","mouni"],
    "age" : [25,23,None]
})
df

    name   age
0   siri  25.0
1  deepu  23.0
2  mouni   NaN

In [73]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False   True

In [75]:
df.isnull().sum() #total missing numbers

name    0
age     1
dtype: int64

In [81]:
df[df.isnull().any(axis=1)] #Show rows with missng

    name  age
2  mouni  NaN

In [83]:
df['age'] = df['age'].fillna(df['age'].mean())

In [85]:
df

    name   age
0   siri  25.0
1  deepu  23.0
2  mouni  24.0

In [95]:
df_clean = df.dropna()
df_clean

    name   age
0   siri  25.0
1  deepu  23.0

# Duplicates

In [98]:
df = pd.DataFrame({
    "name" : ["siri","deepu","siri"],
    "age" : [25,23,25]
})
df

    name  age
0   siri   25
1  deepu   23
2   siri   25

In [100]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [102]:
df[df.duplicated()]

   name  age
2  siri   25

In [106]:
df = df.drop_duplicates()
df

    name  age
0   siri   25
1  deepu   23